import Tyrenko

response = Tyrenko.determined_text_to_title('Децентрализованные финансовые сервисы, или децентрализованные финансы ', 
                                            'общее название для аналогов традиционных финансовых инструментов, реализованных в децентрализованной архитектуре[1]. Эти сервисы общедоступны, являются проектами с открытым исходным кодом и чаще всего основаны на смарт-контрактах. К децентрализованным финансовым сервисам относятся некастодиальные протоколы для кредитования под залог криптоактивов, децентрализованные биржи (DEX), рынки предсказаний и протоколы выпуска синтетических активов и деривативов. Финансовые инструменты, существующие на одной блокчейн-платформе, могут быть скомпонованы между собой различными способами благодаря программной совместимости смарт-контрактов и стандартизации токенов[2].')
print(response)
